paypal-connector-test/src/test/resources/artifacts/ESB/config/soapRequests/paypal/captureAuthorization.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="wso2.connector.paypal.captureauthorization">
   <soapenv:Header/>
   <soapenv:Body>
     <urn:paypalApiUrl>https://api.sandbox.paypal.com</urn:paypalApiUrl>
     <urn:authorization>Bearer 7RDA.3yMKBJrpm.wu-3FPuJ1r7mXqfe6mcIehN64CWE</urn:authorization>
     <urn:authorizationId>1YX29508P9582B65</urn:authorizationId>
     <urn:amountValue>4.54</urn:amountValue>
     <urn:currencyCode>USD</urn:currencyCode>
     <urn:isFinalCaptur>true</urn:isFinalCaptur>
   </soapenv:Body>
</soapenv:Envelope>
